<title>3-D Wave Simulation Directions</title>
<body>
<hr>


<p><A href="index_de.html">Das Java-Applet</a>
demonstriert Skalar-Wellen in 3 Dimensionen, z. B. Schallwellen.
(Elektromagnetische Wellen bestehen aus Vektoren, daher wird dies im Applet
nicht ganz korrekt dargestellt.) 

<p>Wenn das Applet
startet, wirst Du rote und gr&uuml;ne Wellen sehen, die sich von einer Punktquelle
in der Mitte des W&uuml;rfels entfernen. Die Farbe gibt dabei jeweils den
akustischen Druck an. Die gr&uuml;nen Bereiche sind negativ und die roten positiv.

<p>Das erste, was Du
tun solltest, wenn das Applets startet, sind die Einstellungen f&uuml;r Deinen
Computer anzupassen. Klicke zun&auml;chst die &quot;Alternate
Rendering&quot;-checkbox, falls noch nicht geschehen. In Abh&auml;ngigkeit von
Deinem Browser wird die Bewegung fl&uuml;ssiger oder das Bild beginnt zu stottern.
Falls das der Fall ist, entferne das H&auml;kchen wieder.

<p>Als n&auml;chstes
erh&ouml;hst du die Aufl&ouml;sung unter &quot;Image Resolution&quot; soweit wie es geht,
ohne dass das Applets zu langsam wird. Falls die Bilder schon stocken,
verringere die Aufl&ouml;sung. Eine weitere Alternative zur Kontrolle der
Geschwindigkeit ist der "Simulate Speed"-Button. Es verbessert zwar nicht die Bildrate,
aber die Wellen werden dadurch schneller.

<p>Im Setup-Men&uuml;
kannst Du folgende Einstellungen vornehmen: 

<ul type=disc>
 <li><b>Point Source:</b>: einzelne
     Punktquelle inmitten des W&uuml;rfels, die Wellen in den Raum aussendet. 
 <li><b>Pinhole</b>: ebenfalls
     nur eine Einzelquelle, die aber an einer W&uuml;rfelwand liegt. 
 <li><b>2 Point Sources</b>: Hier handelt
     es sich um zwei Punktquellen, deren Wellen interferieren. Mit zunehmender
     Frequenz wird das Interferenzbild deutlicher. Der &quot;Source
     Separation&quot;-Regler gibt die Entfernung der Quellen zueinander an. Mit
     &quot;Phase Difference&quot; kann die Phase der Wellen relativ zueinander
     angepasst werden. &Uuml;ber &quot;Balance&quot; lassen sich die jeweiligen
     St&auml;rken der Wellen anpassen, &auml;hnlich wie bei einem Radio. 
 <li><b>Dipole
     Source</b>: Demonstration eines Dipols 
 <li><b>Lateral Quadrupole</b>: ein
     Quadropol, bei dem die Quellen in einem Viereck angeordnet sind 
 <li><b>Linear Quadrupole</b>: ein
     Quadropol, bei dem die Quellen in einer Linie angeordnet sind. 
 <li><b>2 Pinholes</b>: zwei
     Punktquellen, die sich an einer W&uuml;rfelseite befinden. 
 <li><b>Single Line Source</b>: einzelne
     Linienquelle, die zylindrische Wellen aussendet. 
 <li><b>Single Slit</b>: demonstriert
     Wellen am Einzelspalt. 
 <li><b>2 Line Sources</b>: Zwei
     Linienquellen, deren Wellen interferieren. Du hast die gleichen
     Einstellungsm&ouml;glichkeiten wie bei "2 Point Source". 
 <li><b>Double Slit</b>: Interferenz
     am Doppelspalt. 
 <li><b>Triple Slit</b>: Interferenz
     am Dreifach-Spalt. 
 <li><b>Plane Wave</b>: Ebene
     Wellen, die sich in eine Richtung bewegen. 
 <li><b>2 Plane Waves</b>: Zwei sich
     &uuml;berlappende ebene Wellen. Du kannst &uuml;ber die Regler "Theta" und "Phi" die
     Richtung der ersten Welle steuern, dabei &auml;nderst Du lediglich den Winkel
     der Ausbreitungsrichtung in sph&auml;rischen Koordinaten. Auch die Balance kann
     ver&auml;ndert werden. Befindet sich der Schieber ganz links, ist nur die eine
     Welle pr&auml;sent, dies ist besonders hilfreich, um das Gef&uuml;hl f&uuml;r die Steuerung
     von Tehta und Phi zu erhalten. 
</ul>

<p>Mit "Stopped"
kannst Du das Applet anhalten und wieder starten.

<p>&Uuml;ber Checkbox "<b>Show
Intensity</b>" kannst Du Dir die Wellenintensit&auml;t anschauen im Raum anschauen

<p>"<b>Show Sides"</b>
zeigt Dir den akustischen Druck (oder Intensit&auml;t) ebenfalls an, allerdings nur
an den Seiten des W&uuml;rfels.

<p>"<b>Mouse popup"</b>
hat zwei Funktionen. &Uuml;ber</b> "<b>Mouse = Adjust Angle</b>" kannst Du bei
gehaltener linker Taste den W&uuml;rfel drehen</b>, "<b>Mouse = Adjust
Zoom</b>" erlaubt
das zoomen.

<p><b>&Uuml;ber Slice popup</b> erh&auml;ltst du verschiedene
Querschnitte mit dem Interferenzbild. Bei "<b>No Slicing</b>" siehst Du den
gesamten W&uuml;rfel.

<p>Mit "<b>Simulation
Speed"</b> &auml;nderst Du die Geschwindigkeit der Oszillation.

<p>Der "<b>Brightness"-Regler
</b>kontrolliert die Helligkeit (wie beim Bildschirm), damit wird das Erkennen
schwacher Wellen erleichtert. 

<p>"<b>Image
Resolution</b>" kontrolliert die Aufl&ouml;sung, dabei gilt, je h&ouml;her die Aufl&ouml;sung,
desto langsamer das Applet.

<p>"<b>Frequency</b>" &auml;ndert
die Frequenz der Wellen.
<p>
<a href="index_de.html">Klicke hier, um zum Applet zu gelangen.</a>
<p>
(&Uuml;bersetzt von Markus Scholz.)
<hr>
<a href="http://www.falstad.com/mathphysics.html"><img src="/mathphysics_small.gif"></a>
<a href="http://www.falstad.com/index.html"><img src="/me_small.gif"></a>
<br><i>java@</i><i>falstad.com</i>
</body>
