<title>3-D Electrostatic Field Applet Directions</title>
<body>
<hr>
<a href="index_de.html">Klicke hier, um zum Applet zu gelangen.</a>

<p>Dieses Applet
demonstriert verschiedene elektrische Felder. Du kannst verschiedene Feldtypen
ausw&auml;hlen und sehen, wie sich die Teilchen bewegen, wenn sich das Feld entweder
als "velocity field" (wo sich alle Partikel auf den Feldlinien bewegen) oder
als ein wirkliches Kraftfeld&nbsp; (wo sich die Partikel wie geladene Teilchen
bewegen) verh&auml;lt. Das hilft Dir, das Wirken des Feldes besser zu verstehen. 

<p>Wenn Du das Applet
startest, wirst du 500 Teilchen sehen, die sich auf einer geladenen Linie
(charged line) in Richtung Zentrum bewegen. Standardm&auml;&szlig;ig ist der Modus
"velocity field" eingestellt, d. h. die Feldvektoren allein bestimmen, wie
schnell und in welche Richtung sich die Teilchen bewegen. In diesem Fall
bewegen sich alle Teilchen Richtung Zentrum und fallen anschlie&szlig;end dort
hinein. Die Geschwindigkeit aller Teilchen an einem bestimmten Punkt auf der
Ebene ist stets gleich. Wird das Feld jedoch als ein Kraftfeld angesehen,
bestimmen die Feldvektoren die Beschleunigung der Teilchen, deren Geschwindigkeit
variiert jedoch abh&auml;ngig davon wo die Teilchen starteten.

<p>Im Men&uuml; "<b>Field
Selection"</b> kannst Du die verschiedenen Felder ausw&auml;hlen:

<ul type=disc>
 <li><b>point charge</b>: Feld einer
     einzelnen Punktladung, &Uuml;ber "Reverse" &auml;nderst Du das Vorzeichen der
     Ladung. 
 <li><b>point charge double</b>: Zwei
     Punktladungen mit anpassbarem Abstand zueinander. 
 <li><b>dipole</b>: Zwei Punkte
     gegenteiliger Ladungen, mit anpassbarem Abstand zueinander. 
 <li><b>quadrupole</b>: Zwei
     positive und zwei negative Ladungen. 
 <li><b>charged line</b>: Ladungen,
     die sich auf einer unendlich langen Geraden bewegen. 
 <li><b>line charge double</b>: Zwei
     geladene Geraden 
 <li><b>dipole lines</b>: Zwei Geraden
     gegenteiliger Ladungen 
 <li><b>quad lines</b>: Zwei
     positive und zwei negative geladenen Geraden. 
 <li><b>finite line</b>: Eine
     geladene Gerade endlicher L&auml;nge. Die L&auml;nge kann eingestellt werden. 
 <li><b>finite line pair</b>: Zwei
     geladene Geraden endlicher L&auml;nge. 
 <li><b>finite line dipole</b>: Zwei
     gegenteilig geladene Geraden endlicher L&auml;nge. 
 <li><b>conducting plate</b>: Eine
     leitende Platte, endlich in x-Richtung aber unendlich in y-Richtung.
     Plattengr&ouml;&szlig;e in x-Richtung anpassbar. 
 <li><b>charged plate</b>: Eine
     geladene Platte, endlich in x-Richtung aber unendlich in y-Richtung.
     Plattengr&ouml;&szlig;e in x-Richtung anpassbar. 
 <li><b>charged plate pair</b>: Zwei
     verschieden geladene Platten. Gr&ouml;&szlig;e und Entfernung der Platten
     ver&auml;nderbar. 
 <li><b>infinite plane</b>: Eine
     unendlich geladene Ebene. 
 <li><b>conducting sphere + pt</b>: Eine
     leitende Kugel in der N&auml;he einer Punktladung. Kugelgr&ouml;&szlig;e, der
     Abstand-Kugel-Punktladung und das Potential der Kugel sind ver&auml;nderbar.
     Standardm&auml;&szlig;ig ist die Kugel geerdet. 
 <li><b>charged sphere + pt</b>: Eine
     geladene Kugel nahe einer Punktquelle. Diese Einstellung eignet sich
     hervorragend, um den Unterschied zwischen einer leitenden und einer
     geladenen Kugel zu zeigen. (Der Hauptunterschied liegt darin, dass bei
     einer leitenden Kugel die Feldlinien des E-Feldes stets senkrecht zu
     Kugeloberfl&auml;che verlaufen, w&auml;hrend das bei einer geladenen Kugel nicht der
     Fall ist. (Der Modus "Y-Slice" zeigt das sehr gut!) Standardm&auml;&szlig;ig ist die
     Kugel neutral, sie kann jedoch positiv oder negativ geladen werden. 
 <li><b>cyl + line charge</b>: Ein
     leitender Zylinder in der N&auml;he einer geladenen Gerade. 
 <li><b>conducting sphere in
     field</b>: Eine geerdete, leitende Kugel in einem uniformen, externen Feld. 
 <li><b>dielec sphere in field
     E</b>: Das elektrische Feld einer dieelektrischen Kugel in einem
     uniformen, externen Feld. Kugelgr&ouml;&szlig;e und die St&auml;rke der Dieelektrizit&auml;t
     anpassbar. 
 <li><b>dielec sphere
     in field D</b>: Dies ist die magnetische Flussdichte einer
dielektrischen Kugel, die sich in einem externen, homogenen E-Feld
befindet. Kugelgr&ouml;&szlig;e und dielektrische St&auml;rke anpassbar.
 <li><b>cylinder in field</b>: Ein
     geerdeter, leitender Zylinder in einem uniformen, externen Feld. 
 <li><b>dielec cyl in field E</b>: Das
     elektrische Feld eines dielektrischen Zylinders in einem uniformen und
     externen E-Feld. Zylindergr&ouml;&szlig;e und die St&auml;rke der Dielektrizit&auml;t sind
     anpassbar. 
 <li><b>dielec cyl in
     field D</b>: Dies ist die magnetische Flussdichte eines
dielektrischen Zylinders, der sich in einem externen, homogenen E-Feld
befindet. Zylindergr&ouml;&szlig;e und dielektrische St&auml;rke anpassbar.
 <li><b>dielec boundary E</b>: Das ist das
     elektrische Feld einer Punktladung nahe eines Isolators. Die Ladung ist
     standardm&auml;&szlig;ig au&szlig;erhalb vom Isolator, d. h. das Dielektrikum befindet sich
     unterhalb der Grenzebene. Die Position der Ladung und die Isolatorst&auml;rke
     sind einstellbar. 
 <li><b>dielec boundary
     D</b>: Dies ist die magnetische Flussdichte einer
Punktladung nahe einer dielektrischen Grenze. Ort der Punktladung und
die magnetische Flussdichte einstellbar.
  <li><b>conducting plane + pt</b>: Das elektr.
     Feld einer Punktladung in der N&auml;he
     eines Leiters.
 <li><b>fast charge</b>: Das ist das
     elektrische Feld einer Punktladung, die sich etwa mit Lichtgeschwindigkeit
     bewegt. Das ist der Grund, warum das Feld verzerrt erscheint. Das
     Verh&auml;ltnis Geschwindigkeit(Teilchen)/Lichtgeschwindigkeit ist verstellbar.
 <li><b>charged ring</b>: Ein
     gleichm&auml;&szlig;ig geladener Ring. Die Ringgr&ouml;&szlig;e ist einstellbar.
 <li><b>charged ring pair</b>: Zwei
     gleichm&auml;&szlig;ig geladene Ringe. 
 <li><b>charged ring dipole</b>: Zwei
     gegens&auml;tzlich geladene Ringe. 
 <li><b>slotted conducting
     plane</b>: Eine leitende Platte (geerdet) mit einem eingeschnittenen
     rechteckigen Spalt. Die Platte befindet sich in einem gleichm&auml;&szlig;igen,
     externem E-Feld. Der Spalt ist unendlich lang, aber endlich in der Breite.
     Die Breite ist anpassbar. 
 <li><b>conducting planes w/
     gap</b>: Zwei unendliche, leitende Platten, eine mit positivem Potential,
     die andere mit negativem Potential. 
</ul>

<p><![if !supportEmptyParas]>&nbsp;<![endif]>

<p>Das "<b>Display-Men&uuml;"</b>
erm&ouml;glicht, die Ansicht des E-Feldes zu &auml;ndern:

<ul type=disc>
 <li><b>Display: Particles
     (Vel.)</b>: bedeutet, dass sich Teilchen durch das Feld bewegen, wobei die
     Vektoren deren Geschwindigkeit anzeigen. Beachte, dass die Teilchen
     lediglich ein Hilfsmittel zur Darstellung des Feldes sind, in der Realit&auml;t
     verhalten sich die Teilchen nicht wie gezeigt. Display: Particles (Force):
     bedeutet, dass sich Teilchen durch das Feld bewegen, wobei die Vektoren
     deren Beschleunigung darstellen.
 <li><b>Display: Field
     Vectors</b>: Anzeige einiger Feld-Vektoren. 
 <li><b>Display: Field
     Lines</b>: Anzeige der Feldlinien. Der "Line
     Density"-Regler kontrolliert die menge der angezeigten Linien. Dabei gibt
     die Farbe Auskunft &uuml;ber die Feldst&auml;rke.
 <li><b>Display:
     Equipotentials</b>: Darstellung von Ebenen gleichen Potentials. Standardm&auml;&szlig;ig ist
     "Slicing" dabei eingeschaltet, weil man dann die Ebenen leichter erkennt
     und man mehrere zugleich beobachten kann. Rote Linien
     bedeuten dabei negatives Potential, gr&uuml;n positives Potential, und grau
     meint neutral. Ist "Slicing" abgeschaltet, kann man nur eine Ebene sehen. Der
     "Potential"-Regler erlaubt Dir, einzustellen, welche Ebene du siehst. Ist
     dieser zu hoch oder zu niedrig eingestellt, existieren entweder keine
     &Auml;qui-Potentiale oder sie sind zu klein/gro&szlig;. Ver&auml;ndere dazu diesen Regler,
     um das Problem zu beheben.
</ul>

<p>Das "<b>Mouse</b>"-Fenster kontrolliert, was
passiert, wenn du in das Fenster klickst. Wenn du diese einstellung "Adjust Angle" oder "Adjust Zoom" setzt, kannst du
die Richtung der Ansicht und deren Gr&ouml;&szlig;e andern, wenn Du in das Fenster klickst
und die Maus bewegst.

<p>Das
"<b>Slice</b>"-Men&uuml; erlaubt es dir nicht nur in den W&uuml;rfel hinein zu schauen,
sondern auch die einzelnen W&auml;nde (besser Koordinatenebenen) zu betrachten. "No
Slicing" bedeutet, dass du in den Raum blickst. Bei einer anderen Einstellung
erh&auml;ltst Du die Ansicht einer Koordinatenebene. Auf welche du blickst, h&auml;ngt
von der Einstellung (X, Y, Z) ab. Du kannst mit der Maus den Blickwinkel
ver&auml;ndern

<p><b>Stopped</b>: Stoppt
die Simulation 

<p><b>Reverse</b>: Umkehrung
aller Feldvektoren

<p><b>Reset</b>:
Wiederherstellung der Standardeinstellung 

<p><b>Kick</b>: Erteile
hiermit allen Teilchen einen Sto&szlig; in zuf&auml;lliger Richtung. Dies ist nur m&ouml;glich,
wenn die Einstellung "Particles: Force" ausgew&auml;hlt ist. Diese Funktion ist
besonders n&uuml;tzlich, wenn sich die Teilchen nicht bzw. alle in dieselbe Richtung
bewegen

<p><b>Field
Strength</b>: Dieser Regler ver&auml;ndert die St&auml;rke des Feldes und hat
au&szlig;erdem Einfluss auf die Helligkeit der Feldvektoren, wenn du sie
eingeschaltet hast (Display: Field Vector). 

<p><b>Vector
Density</b>: Steuert die Anzahl der gezeigten Feldvektoren, wenn Du
"Display: Field Vectors" aktiviert hast. 

<p><b>Number
of Particles</b>: Mit diesem Regler bestimmst du die Anzahl der dargestellten
Teilchen. Sehr n&uuml;tzlich, um das Verhalten von wenigen Teilchen zu beobachten. Au&szlig;erdem kann durch eine erh&ouml;hte Anzahl von Teilchen die Simulation
beschleunigt werden.

<p>Es
k&ouml;nnen weitere Regler w&auml;hrend der Simulation vorhanden sein, je nach den
Einstellungen, die Du gew&auml;hlt hast.
<p>
<a href="index_de.html">Klicke hier, um zum Applet zu gelangen.</a>
<p>
(&Uuml;bersetzt von Markus Scholz.)
<hr>
<a href="/mathphysics.html"><img src="/mathphysics_small.gif"></a>
<a href="/index.html"><img src="/me_small.gif"></a>
<br><i>java@</i><i>falstad.com</i>
</body>
