<title>2-D Electrostatic Field Applet Directions</title>
<body>
<hr>
<a href="index_de.html">Klicke hier, um zum Applet zu gelangen.</a>
<p>
Dieses Applet
demonstriert verschiedene elektrische Felder. Du kannst verschiedene Feldtypen
ausw&auml;hlen und sehen, wie sich die Teilchen bewegen, wenn sich das Feld entweder
als "velocity field" (wo sich alle Partikel auf den Feldlinien bewegen) oder
als ein wirkliches Kraftfeld&nbsp; (wo sich die Partikel wie geladene Teilchen
bewegen) verh&auml;lt. Das hilft Dir, das Wirken des Feldes besser zu verstehen. 

<p>Wenn Du das Applet
startest, wirst du 500 Teilchen sehen, die sich auf einer geladenen Linie
(charged line) in Richtung Zentrum bewegen. Standardm&auml;&szlig;ig ist der Modus
"velocity field" eingestellt, d. h. die Feldvektoren allein bestimmen, wie
schnell und in welche Richtung sich die Teilchen bewegen. In diesem Fall
bewegen sich alle Teilchen Richtung Zentrum und fallen anschlie&szlig;end dort
hinein. Die Geschwindigkeit aller Teilchen an einem bestimmten Punkt auf der
Ebene ist stets gleich. Wird das Feld jedoch als ein Kraftfeld angesehen,
bestimmen die Feldvektoren die Beschleunigung der Teilchen, deren
Geschwindigkeit variiert jedoch abh&auml;ngig davon wo die Teilchen starteten. 

<p>Das "<b>Setup</b>"-Men&uuml;
erm&ouml;glicht Dir folgende Einstellungen: 

<ul type=disc>
 <li><b>charged line</b>: Ladungen,
     die sich auf einer unendlich langen Geraden bewegen. 
 <li><b>line charge double</b>: Zwei
     geladene Geraden. 
 <li><b>dipole lines: </b>Zwei Geraden unterschiedlicher
     Ladungen 
 <li><b>quad lines</b>: Zwei postiv-
     und zwei negativ-geladene Geraden. 
 <li><b>point charge</b>: Feld einer
     einzelnen, punktf&ouml;rmigen Ladungsquelle. Dies ist ein zweidimensionaler
     Querschnitt des dreidimensionalen Feld. In drei Dimensionen, betr&auml;gt der
     Ladungsunterschied null, au&szlig;er in der Ladungsquelle selbst. Aber in diesem
     Querschnitt ist die Divergenz stets positiv (au&szlig;er die Quelle, sie ist
     negativ), 
 <li><b>point charge double</b>: Zwei
     punktf&ouml;rmige Ladungsquellen, mit ver&auml;nderbarem Abstand zueinander. 
 <li><b>dipole</b>: Zwei Punkte
     unterschiedlicher Ladung, deren Abstand zueinander ge&auml;ndert werden kann. 
 <li><b>quadrupole</b>: Zwei
     positive und zwei negative Ladungen. 
 <li><b>conducting plate</b>: Eine
     leitende Platte (gr&ouml;&szlig;enverstellbar). 
 <li><b>charged plate</b>: Eine
     geladene Platte (gr&ouml;&szlig;enverstellbar). 
 <li><b>charged plate pair</b>: Zwei
     geladene Platten (Gr&ouml;&szlig;e und gegenseitiger Abstand einstellbar) 
 <li><b>charged plate dipole</b>: Platten
     unterschiedlicher Ladung. Die Gr&ouml;&szlig;e und der Plattenabstand ist ebenfalls
     einstellbar. 
 <li><b>infinite plane</b>: Eine
     unendlich geladene Ebene. 
 <li><b>conducting cylinder</b>: Ein
     leitender Zylinder mit ver&auml;nderbarem Potenzial. 
 <li><b>cyl + line charge</b>: Ein
     leitender Zylinder in der n&auml;he einer geladenen Gerade. 
 <li><b>cylinder in field</b>: ein
     geerdeter, leitender Zylinder in einem uniformen (externen) elektrischen Feld. 
 <li><b>dielec cyl in field</b>: Ein
     elektrisches Feld eines dielektrischen Zylinder, der sich wiederum in
     einem uniformen und externem E-Feld befindet. Zylindergr&ouml;&szlig;e und die St&auml;rke
     der Dielektrizit&auml;t anpassbar. 
 <li><b>slotted conducting
     plane</b>: Eine geerdete, leitende Platte mit einem rektangul&auml;rem
     (rechtwinkligem) Spalt. Die Platte befindet sich einem uniformen, externen
     E-Feld. Die Spaltgr&ouml;&szlig;e ist ver&auml;nderbar. 
 <li><b>conducting planes w/
     gap</b>: Zwei unendlich leitende Platten, die eine mit positivem, die
     andere mit negativem Potenzial. Zwischen den Platten ist eine L&uuml;cke. 
</ul>

<p>Das "<b>Color</b>"-Men&uuml;
erlaubt dir die Farbe des Bodens zu &auml;ndern. Im Allgemeinen zeigt Dir die Farbe
die St&auml;rke verschiedener physikalischer Gr&ouml;&szlig;en in einem bestimmten Punkt, dabei
steht gr&uuml;n f&uuml;r positiv, grau bedeutet null und rot bedeutet negativ. Folgende
Optionen hast Du: 

<ul type=disc>
 <li><b>Field Magnitude: </b>gezeigt wird
     die St&auml;rke des E-Feldes, bei starkem Feld ist die Fl&auml;che gr&uuml;n, ist das
     Feld schwach oder nicht pr&auml;sent, ist sie grau. 
 <li><b>Potential:</b> das Potenzial
     wird angezeigt, falls vorhanden 
 <li><b>None:</b> Fl&auml;che ist
     immer grau 
 <li><b>Charge:</b> der Boden
     zeigt die Ladungsdivergenz (Ladungsdichte) des E-Feldes 
</ul>

<p>Im <b>Floor</b>-Men&uuml;
kannst du einstellen, ob du einfache Linien zur Orientierung (grid),
&Auml;quipotenziallinien Feldlinien oder gar keine Linien dargestellt bekommen
m&ouml;chtest. 

<p>Mit <b>Flat View</b>
erh&auml;lst du ein 2D-Bild des Vektorfeldes. Schaust Du Dir Feldvektoren an oder
benutze die Mausoptionen line- oder surface-integral, ist diese Option
automatisch angew&auml;hlt

<p>Im <b>Display-</b>Men&uuml;
kannst Du bestimmen, wie sich die Teilchen bewegen:

<ul type=disc>
 <li><b>Display: Particles
     (Vel.)</b> Es bewegen sich Teilchen durch das Feld, wobei die Feldvektoren
     die Geschwindigkeit der Teilchen bestimmen 
 <li><b>Display: Particles
     (Force)</b> Auch hier bewegen sich Teilchen durch das Feld, aller bestimmen
     die Feldvektoren hier die Beschleunigung der Teilchen
     
 <li><b>Display: Field Vectors</b> Feldvektoren
     werden als Pfeile dargestellt. 
 <li><b>Display: None</b> Es werden
     weder Teilchen noch Vektoren dargestellt 
</ul>

<p>Das Mouse-Men&uuml;
kontrolliert, was passiert, wenn Du in die Animation klickst. So kannst du bei
gehaltener Maustaste bei <b>Adjust Angle</b> den W&uuml;rfel frei drehen oder mit <b>Adjust
Zoom</b> bei gehaltener Maustaste herein- bzw. herauszoomen. W&auml;hlst Du <b>Line
Integral</b> kanst du in der Animation eine "Integral-Linie" erstellen, indem
Du ein Rechteck aufziehst. Unten links wird Dir die Zirkulation in diesem
Bereich dargestellt, sie sollte nach Faraday's Gesetz null betragen, da es sich
um ein statisches Feld handelt. Mit <b>Surface Integral</b> erzeugst Du bei
gleicher Vorgehensweise wie bei Line-Integral ein Oberfl&auml;chen-Integral. Unten
Links wird der Fluss berechnet. Dieser sollte nach dem Gaussschen Gesetz proportional
zur Gesamtladung sein. 

<p><b>Stopped</b>: h&auml;lt die Animation an /
startet sie erneut

<p><b>Reverse</b>: Umkehrung aller
Feldvektoren

<p><b>Reset: </b>Wiederherstellung aller
Standardwerte

<p>Mit <b>Kick</b>
erteilst Du allen Teilchen eine zuf&auml;llige Beschleunigung in irgendeine
Richtung. Diese Option ist nur m&ouml;glich, wenn die Teilchen sich im "Force"-Modus
befinden. Besonders hilfreich ist diese Option, wenn alle Teilchen still stehen
oder sich alle in dieselbe Richtung bewegen.

<p>&Uuml;ber <b>Field
Strength</b> steuerst Du die Feldst&auml;rke des E-Feldes und gleichzeitig die Farbe
der Vektorpfeile, wenn Du im Men&uuml;&nbsp; <b>Display: Field Vectors</b> aktiviert
hast.

<p>Der Regler <b>"Vector
Density"</b> kontrolliert die Dichte der Pfeile, wenn Du unter <b>Display:
Field Vectors</b> eingestellt hast

<p>&Uuml;ber <b>Number of
Particles</b> steuerst du die Menge der angezeigten Teilchen.

<p>Unter Umst&auml;nden
sind weitere spezifische Regler vorhanden, je nach dem, was Du f&uuml;r eine
Darstellung anw&auml;hlst.
<p>
<a href="index_de.html">Klicke hier, um zum Applet zu gelangen.</a>
<p>
(&Uuml;bersetzt von Markus Scholz.)
<hr>
<a href="http://www.falstad.com/mathphysics.html"><img src="/mathphysics_small.gif"></a>
<a href="http://www.falstad.com/index.html"><img src="/me_small.gif"></a>
<br><i>java@</i><i>falstad.com</i>
</body>
