<title>Sound Wave Interference Applet</title>
<body>
<hr>
<OBJECT classid="clsid:8AD9C840-044E-11D1-B3E9-00805F499D93" WIDTH = 600 HEIGHT = 40
  codebase="http://java.sun.com/products/plugin/1.3/jinstall-13-win32.cab#Version=1,3,0,0">
<param name="code" value="Interference.class">
<param name="archive" value="interference.jar">
</object>
<hr>
Dieses Java-Applet
demonstriert die Interferenz von zwei Schallwellen. Die Experimente kannst Du
zu Hause durchf&uuml;hren. Dazu brauchst Du zwei Lautsprecher (oder
<a target="_blank"
href="http://hyperphysics.phy-astr.gsu.edu/hbase/sound/reflec2.html#c2">ein
Lautsprecher und eine Wand</a> und
eine Soundkarte (vorzugsweise Stereo).

<p>Bestimme zun&auml;chst
den Abstand Deiner Lautsprecher zueinander und stelle mit dem "<b>Speaker
Separation"-</b>Regler den gleichen Abstand ein. (Du solltest <b>Metric Units </b>aktiviert
lassen, ansonsten erh&auml;ltst du als Ma&szlig;einheit Zoll). Dann schalte den Sound ein
(H&auml;kchen setzen). Du h&ouml;rst einen einzelnen Ton (eine einzige Schallwelle) aus
beiden Lautsprechern, wodurch sich ein Interferenzmuster bildet &auml;hnlich dem,
dass im Applet graphisch dargestellt wird. Die Lautsprecher sind auf dem
Monitor als blaue Punkte dargestellt. Halte Dir nun ein Ohr zu und bewege Dich
vor den Lautsprechern durch Dein Zimmer. Du m&uuml;sstest verschiedene
Lautst&auml;rke-Intensit&auml;ten wahrnehmen, die sich halbwegs mit der dargestellten
Graphik decken sollten (nat&uuml;rlich wird es nicht ganz &uuml;bereinstimmen, da
Reflexionen an W&auml;nden und Gegenst&auml;nden st&auml;ndig vorhanden sind). Au&szlig;erdem
verwendet das Applet als Schallquelle eine Punktquelle, was in der Realit&auml;t
jedoch nicht ganz der Fall ist.

<p>Falls Deine
Soundkarte Stereo unterst&uuml;tzt, schalte auch Stereo-Sound ein (H&auml;kchen vor
Stereo). Um sicherzustellen, dass der Stereo-Klang funktioniert, schiebe den <b>Balance</b>-Regler
hin und her. Mit eingeschaltetem Stereo kannst Du die relative Phase der Wellen
aus beiden Lautsprechern untereinander ver&auml;ndern. Standardm&auml;&szlig;ig sind die Wellen
um 180&deg; phasenverschoben, d. h. genau zwischen den Lautsprechern ist die
Sound-Intensit&auml;t sehr niedrig.

<p>Beachte, dass, wenn
du einen Subwoofer angeschlossen hast, dieser tiefe T&ouml;ne eher wiedergibt als
Deine normalen Lautsprecher, sodass das graphische Interferenzbild nicht mit
dem akustischen Interferenzbild &uuml;bereinstimmt.

<p>Mit der Maus kannst
du Abst&auml;nde messen, indem Du an den einen Punkt klickst und die Maus zum
zweiten Punkt ziehst. Die Abst&auml;nde beziehen sich nat&uuml;rlich direkt auf Dein
Zimmer, anfangs hast Du ja den Abstand Deiner Lautsprecher eingestellt. 

<p>Das Interferenzbild
eines Lautsprechers und einer Wand kannst Du Dir ebenfalls anzeigen lassen.
Dazu musst du die "Speaker Seperation" so einstellen, dass sie gerade dem doppelten
Abstand Lautsprecher-Wand entspricht. Deaktiviere Stereo oder stelle die
Phasenverschiebung auf null. Die Wand musst Du Dir vertikal in der Mitte des
Bildschirmes vorstellen.

<p>Es ist auch sehr
interessant, die Lautsprecher genau nebeneinander zu stellen und (bei Stereo)
die Phasenverschiebung auf 180&deg; zu stellen!
<p>
<a href="Interference.java">Quelltext.</a>
<p>
<a href="http://www.falstad.com/mathphysics.html">Mehr Applets.</a>
<p>
<a href="interference.zip">ZIP-Archiv dieses Applets.</a>
<p>
<A href="index.html">English version.</a>
<p>
(&Uuml;bersetzt von Markus Scholz.)
<hr>
<a href="http://www.falstad.com/mathphysics.html"><img src="/mathphysics_small.gif"></a>
<a href="http://www.falstad.com/index.html"><img src="/me_small.gif"></a>
<br><i>java@</i><i>falstad.com</i>
</body>
